;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

(package! adoc-mode)
(package! color-identifiers-mode)
(package! evil-escape :disable t)
(package! evil-snipe :disable t)
(package! flycheck-clj-kondo)
(package! flymd)
(package! lispyville)
(package! sort-words)
(package! uuidgen)
(package! vlf)
